Revit 2027 API
FabricationDimensionDefinition.IsModifiable Property
 Checks if the fabrication dimension is modifiable by user.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsModifiable { get; }
Public ReadOnly Property IsModifiable As Boolean
	Get
public:
property bool IsModifiable {
	bool get ();
}
member IsModifiable : bool with get
Property Value
Boolean
See Also
Reference
FabricationDimensionDefinition Class
Autodesk.Revit.DB Namespace